core/readModels/Shop/CategoryReadRepository.php

SELECT * FROM `shop_categories` WHERE `lft`=1
---
    public function getAll(): array
    {
        return Category::find()->andWhere(['>', 'depth', 0])->orderBy('lft')->all();