core/readModels/Shop/ProductReadRepository.php

SELECT * FROM `shop_photos` WHERE `id`=3
---
    public function getAllByBrand(Brand $brand): DataProviderInterface
    {
        $query = Product::find()->alias('p')->active('p')->with('mainPhoto');