core/readModels/Blog/PostReadRepository.php

    public function getLast($limit): array
    {
        return Post::find()->active()->with('category')->orderBy(['id' => SORT_DESC])->limit($limit)->all();
---
SELECT * FROM `blog_categories` WHERE `id`=1