core/readModels/User/UserReadRepository.php

    public function find($id): array|ActiveRecord
    {
        return User::find()->with(['employee'])->andWhere(['id' => $id])->one();
---
SELECT * FROM `users` WHERE `id` IS NULL