<?php

return [
    'greeting' => 'Здравствуйте',
    'follow' => 'Перейдите по ссылке ниже, чтобы сбросить пароль:',
    'follow-email'=>'Перейдите по ссылке ниже, чтобы проверить свою электронную почту:',
    'check-email'=>'Проверьте свою электронную почту, чтобы получить дальнейшие инструкции.',
    'new-pass'=>'Новый пароль сохранен.',
    'new-password'=>'Новый пароль:',
    'reset-pass'=>'Пожалуйста, заполните свой адрес электронной почты. На него будет отправлена ссылка для сброса пароля.',
    'reset-password'=>'Сброс пароля.',
    'email-confirmed'=>'Ваш e-mail подтвержден',
    'Signup'=>'Регистрация',
    'instruction'=>'Чтобы зарегистрироваться, заполните следующие поля:',
    'Send'=>'Отправить',
    'Request password reset'=>'Запрос на сброс пароля',
    'fill-email'=>'Пожалуйста, заполните свой адрес электронной почты. На него будет отправлено письмо с подтверждением.',
    'resend-email' => 'Письмо с подтверждением',
    'email-title'=>'Регистрация аккаунта на сайте '
];