core/readModels/PageReadRepository.php

SELECT * FROM `pages` WHERE (`slug`='index.html') AND (`depth` > 0)
---
    public function findBySlug($slug): ?Page
    {
        return Page::find()->andWhere(['slug' => $slug])->andWhere(['>', 'depth', 0])->one();